# FamilyInstanceCreationData Properties

---
The FamilyInstanceCreationData type exposes the following members.
| Name| Description
---|---|---
| Axis|  Get or set the axis of the FamilyInstance
| RotateAngle|  Get or set the rotate angle of the FamilyInstance
Top
#### Reference
FamilyInstanceCreationData Class
Autodesk.Revit.Creation Namespace